Расширение_ЛаРС_Доработки_Бух/Documents/ЛаРС_ВводЗадолженностиПоИску.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛаРС_ВводЗадолженностиПоИску</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛаРС_ОплатаИсков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Иск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛаРС_Иски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширение_ЛаРС_Доработки_Бух/Documents/ЛаРС_ВводЗадолженностиПоИску/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ИскПриИзмененииНаСервере()

	Объект.СуммаИска = Объект.Иск.СуммаИска;
	Объект.Госпошлина = Объект.Иск.Госпошлина;
	Объект.Пени = Объект.Иск.Пени;

КонецПроцедуры

&НаКлиенте
Процедура ИскПриИзменении(Элемент)
	ИскПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
	Основание = ЭтотОбъект.Параметры.ЗначенияЗаполнения;
	Если ТипЗнч(Основание.Основание) = Тип("СправочникСсылка.ЛаРС_Иски") Тогда
		Объект.СуммаИска = Основание.Основание.СуммаИска;
		Объект.Госпошлина = Основание.Основание.Госпошлина;
		Объект.Пени = Основание.Основание.Пени;
		Объект.Иск = Основание.Основание;
	КонецЕсли;
Исключение
	КонецПопытки;
		
КонецПроцедуры
